Revit 2027 API
BuiltInFailures.ImportFailures.TooManyPickFaces Property
 Too many faces were created from imported meshes. Host by Face tools may not select the imported meshes correctly. Decrease the complexity of the file or try importing only selected layers to resolve.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId TooManyPickFaces { get; }
Public Shared ReadOnly Property TooManyPickFaces As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ TooManyPickFaces {
	FailureDefinitionId^ get ();
}
static member TooManyPickFaces : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ImportFailures Class
Autodesk.Revit.DB Namespace